///week10-3.cpp 泡泡排序法 練習（大到小排序）Part 1
/// (1) 陣列宣告 (2) for 迴圈印出陣列 (3) 減1的迴圈做交換 (4) for 迴圈印出陣列

#include <stdio.h>

int main()
{
    int a[10] = {0,1,2,3,4,5,6,7,8,9}; /// 陣列宣告

    /// 第一段：印出原始陣列
    for (int i = 0; i < 10; i++) { /// 逐一印出
        printf("%d ", a[i]); /// 空格隔開
    }
    printf("\n"); /// 換行

    /// 第二段：氣泡排序（只做一輪）
    for (int i = 0; i < 10 - 1; i++) { /// 小心 i+1 → 所以到 10-1的 減1的迴圈
        if (a[i] < a[i + 1]) { /// 如果大到小排序
            int temp = a[i];   /// 就交換
            a[i] = a[i + 1];
            a[i + 1] = temp;
        }
    }

    /// 第三段：印出排序後（只一輪後）
    for (int i = 0; i < 10; i++) { /// 逐一印出
        printf("%d ", a[i]); /// 空格隔開
    }
    printf("\n"); /// 換行
}
